### Report for deductions

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- deductions-core in modules/deductions-core
Downloading registry.terraform.io/terraform-aws-modules/vpc/aws 5.5.2 for deductions-core.vpc...
- deductions-core.vpc in .terraform/modules/deductions-core.vpc
- deductions-private in modules/deductions-private
- deductions-private.mq-admin in modules/deductions-private/mq-admin
Downloading registry.terraform.io/terraform-aws-modules/vpc/aws 5.5.2 for deductions-private.vpc...
- deductions-private.vpc in .terraform/modules/deductions-private.vpc
Downloading registry.terraform.io/terraform-aws-modules/dynamodb-table/aws 4.0.0 for ehr_transfer_tracker_dynamodb_table...
- ehr_transfer_tracker_dynamodb_table in .terraform/modules/ehr_transfer_tracker_dynamodb_table
- repo in modules/mhs
- repo.cluster in modules/mhs/cluster-network
- test-harness in modules/mhs
- test-harness.cluster in modules/mhs/cluster-network
- utils in modules/utils
Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 5.20.0, >= 5.21.0, 5.37.0"...
- Finding latest version of hashicorp/archive...
- Installing hashicorp/aws v5.37.0...
- Installed hashicorp/aws v5.37.0 (signed by HashiCorp)
- Installing hashicorp/archive v2.7.1...
- Installed hashicorp/archive v2.7.1 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (1 to add, 179 to change, 9 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.allow_access_from_billing_to_s3 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "allow_access_from_billing_to_s3" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
              + "s3:GetBucketPolicy",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::dev-cost-and-usage",
            ]

          + principals {
              + identifiers = [
                  + "billingreports.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::dev-cost-and-usage/*",
            ]
          + sid       = "Stmt[REDACTED_AWS_ACCOUNT_ID]6"

          + principals {
              + identifiers = [
                  + "billingreports.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::dev-cost-and-usage",
              + "arn:aws:s3:::dev-cost-and-usage/*",
            ]
          + sid       = "S3EnforceHTTPSPolicy"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # data.aws_iam_policy_document.deny_load_balancers_to_publish_to_access_logs_s3_bucket will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "deny_load_balancers_to_publish_to_access_logs_s3_bucket" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::dev-repo-load-balancer-access-logs",
              + "arn:aws:s3:::dev-repo-load-balancer-access-logs/*",
            ]

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_cloudwatch_event_rule.generate_cost_report_end_of_every_month will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "generate_cost_report_end_of_every_month" {
        id                  = "generate-cost-report-end-of-every-month"
        name                = "generate-cost-report-end-of-every-month"
      ~ tags                = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
        }
      ~ tags_all            = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_dynamodb_migration_scan_put_update_and_kms_decrypt will be destroyed
  # (because aws_iam_policy.lambda_dynamodb_migration_scan_put_update_and_kms_decrypt is not in configuration)
  - resource "aws_iam_policy" "lambda_dynamodb_migration_scan_put_update_and_kms_decrypt" {
      - arn         = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/lambda-dynamodb-scan-put-update-and-kms-decrypt-policy" -> null
      - description = "Allows Lambda to scan, put and update for the dev-ehr-transfer-tracker as well as decrypting a KMS key" -> null
      - id          = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/lambda-dynamodb-scan-put-update-and-kms-decrypt-policy" -> null
      - name        = "lambda-dynamodb-scan-put-update-and-kms-decrypt-policy" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/dev-ehr-transfer-service-transfer-tracker",
                        ]
                      - Sid      = "DynamoDBScan"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                          - "dynamodb:UpdateItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/dev-ehr-transfer-tracker",
                        ]
                      - Sid      = "DynamoDBPutAndUpdate"
                    },
                  - {
                      - Action   = [
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:kms:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:key/9ee3a9c4-3fae-4622-b328-1c9e58a536b7",
                        ]
                      - Sid      = "KMS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAWCD5NRKJDNYBFHJ5F" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_policy.lambda_rds_migration_access will be destroyed
  # (because aws_iam_policy.lambda_rds_migration_access is not in configuration)
  - resource "aws_iam_policy" "lambda_rds_migration_access" {
      - arn         = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/lambda-rds-access-policy" -> null
      - description = "Allows Lambda to query data in RDS" -> null
      - id          = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/lambda-rds-access-policy" -> null
      - name        = "lambda-rds-access-policy" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "rds:DescribeDBProxyTargetGroups",
                          - "ssm:ListCommands",
                          - "rds:DescribeDBRecommendations",
                          - "rds:DescribeGlobalClusters",
                          - "ssm:ListInstanceAssociations",
                          - "rds:DescribeRecommendations",
                          - "ssm:DescribeAutomationExecutions",
                          - "ssm:GetMaintenanceWindowTask",
                          - "ssm:DescribeMaintenanceWindowExecutionTaskInvocations",
                          - "rds:DescribeDBProxyTargets",
                          - "ssm:DescribeAutomationStepExecutions",
                          - "rds:DownloadDBLogFilePortion",
                          - "ssm:ListResourceDataSync",
                          - "rds:DescribeSourceRegions",
                          - "ssm:ListDocuments",
                          - "ssm:DescribeMaintenanceWindowsForTarget",
                          - "ssm:ListComplianceItems",
                          - "ssm:GetMaintenanceWindowExecutionTask",
                          - "ssm:GetMaintenanceWindowExecution",
                          - "ssm:ListResourceComplianceSummaries",
                          - "ssm:GetOpsMetadata",
                          - "ssm:DescribeOpsItems",
                          - "rds:DescribeReservedDBInstances",
                          - "rds:DescribeBlueGreenDeployments",
                          - "ssm:DescribeMaintenanceWindows",
                          - "rds:DescribeDbSnapshotTenantDatabases",
                          - "rds:DescribeIntegrations",
                          - "ssm:DescribeEffectivePatchesForPatchBaseline",
                          - "ssm:DescribeDocumentPermission",
                          - "ssm:GetAutomationExecution",
                          - "ssm:DescribePatchGroups",
                          - "ssm:GetDefaultPatchBaseline",
                          - "ssm:DescribeDocument",
                          - "rds:DescribeTenantDatabases",
                          - "ssm:ListAssociationVersions",
                          - "ssm:PutConfigurePackageResult",
                          - "ssm:DescribePatchGroupState",
                          - "rds:DescribeDBClusterBacktracks",
                          - "rds:DescribeReservedDBInstancesOfferings",
                          - "ssm:DescribeMaintenanceWindowExecutionTasks",
                          - "ssm:DescribeInstancePatchStatesForPatchGroup",
                          - "rds:DescribeRecommendationGroups",
                          - "rds:DescribeDBInstances",
                          - "rds:DescribeEngineDefaultClusterParameters",
                          - "ssm:GetDocument",
                          - "rds:DescribeDBProxies",
                          - "ssm:GetInventorySchema",
                          - "ssm:GetParametersByPath",
                          - "ssm:GetMaintenanceWindow",
                          - "rds:DescribeEventCategories",
                          - "rds:DescribeDBProxyEndpoints",
                          - "ssm:DescribeAssociationExecutionTargets",
                          - "rds:DescribeEvents",
                          - "ssm:GetPatchBaseline",
                          - "ssm:ListInventoryEntries",
                          - "ssm:DescribeAssociation",
                          - "ssm:ListOpsItemEvents",
                          - "ssm:DescribeSessions",
                          - "ssm:DescribePatchBaselines",
                          - "ssm:GetResourcePolicies",
                          - "ssm:DescribePatchProperties",
                          - "ssm:GetOpsSummary",
                          - "rds:DescribeDBSnapshotAttributes",
                          - "rds:ListTagsForResource",
                          - "ssm:DescribeInstanceInformation",
                          - "ssm:ListTagsForResource",
                          - "ssm:DescribeDocumentParameters",
                          - "ssm:GetCalendar",
                          - "ssm:GetCalendarState",
                          - "rds:DescribeDBInstanceAutomatedBackups",
                          - "ssm:ListDocumentVersions",
                          - "ssm:ListDocumentMetadataHistory",
                          - "ssm:DescribeMaintenanceWindowSchedule",
                          - "ssm:DescribeInstancePatches",
                          - "rds:DescribeEngineDefaultParameters",
                          - "ssm:GetParameter",
                          - "ssm:GetMaintenanceWindowExecutionTaskInvocation",
                          - "rds:DescribeDBClusterAutomatedBackups",
                          - "ssm:ListOpsMetadata",
                          - "ssm:DescribeParameters",
                          - "ssm:GetConnectionStatus",
                          - "rds:DescribeDBSnapshots",
                          - "ssm:GetOpsItem",
                          - "rds:DescribeDBSecurityGroups",
                          - "ssm:GetParameters",
                          - "ssm:ListOpsItemRelatedItems",
                          - "rds:DescribeValidDBInstanceModifications",
                          - "rds:DescribeOrderableDBInstanceOptions",
                          - "ssm:GetServiceSetting",
                          - "ssm:DescribeAssociationExecutions",
                          - "rds:DescribeCertificates",
                          - "ssm:ListCommandInvocations",
                          - "rds:DescribeOptionGroups",
                          - "rds:DescribeDBShardGroups",
                          - "rds:DescribeDBEngineVersions",
                          - "rds:DescribeDBSubnetGroups",
                          - "rds:DescribeExportTasks",
                          - "ssm:DescribeMaintenanceWindowTasks",
                          - "rds:DescribePendingMaintenanceActions",
                          - "rds:DescribeDBParameterGroups",
                          - "ssm:GetPatchBaselineForPatchGroup",
                          - "ssm:DescribeMaintenanceWindowExecutions",
                          - "ssm:GetManifest",
                          - "ssm:DescribeInstancePatchStates",
                          - "rds:DescribeDBParameters",
                          - "ssm:DescribeInstanceAssociationsStatus",
                          - "ssm:DescribeInstanceProperties",
                          - "rds:DescribeDBClusterSnapshotAttributes",
                          - "rds:DescribeDBClusterParameters",
                          - "rds:DescribeEventSubscriptions",
                          - "ssm:GetDeployablePatchSnapshotForInstance",
                          - "ssm:GetParameterHistory",
                          - "ssm:DescribeMaintenanceWindowTargets",
                          - "rds:DescribeDBLogFiles",
                          - "ssm:DescribeEffectiveInstanceAssociations",
                          - "ssm:DescribeInventoryDeletions",
                          - "ssm:GetInventory",
                          - "ssm:DescribeActivations",
                          - "ssm:GetCommandInvocation",
                          - "ssm:ListComplianceSummaries",
                          - "rds:DescribeDBClusterSnapshots",
                          - "rds:DescribeOptionGroupOptions",
                          - "rds:DownloadCompleteDBLogFile",
                          - "rds:DescribeDBClusterEndpoints",
                          - "ssm:ListAssociations",
                          - "rds:DescribeAccountAttributes",
                          - "rds:DescribeDBClusters",
                          - "rds:DescribeDBClusterParameterGroups",
                          - "ssm:DescribeAvailablePatches",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "VisualEditor0"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAWCD5NRKJM7UVGLCNA" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role.dynamo_migration_lambda will be destroyed
  # (because aws_iam_role.dynamo_migration_lambda is not in configuration)
  - resource "aws_iam_role" "dynamo_migration_lambda" {
      - arn                   = "[REDACTED_IAM_ROLE_ARN]" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-05-03T15:25:49Z" -> null
      - force_detach_policies = false -> null
      - id                    = "dev-dynamo-migration-lambda-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/lambda-dynamodb-scan-put-update-and-kms-decrypt-policy",
          - "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/lambda-rds-access-policy",
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaDynamoDBExecutionRole",
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "dev-dynamo-migration-lambda-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAWCD5NRKJF7SWNDONG" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.lambda_dynamodb_migration_execution will be destroyed
  # (because aws_iam_role_policy_attachment.lambda_dynamodb_migration_execution is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_dynamodb_migration_execution" {
      - id         = "dev-dynamo-migration-lambda-role-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]03" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaDynamoDBExecutionRole" -> null
      - role       = "dev-dynamo-migration-lambda-role" -> null
    }

  # aws_iam_role_policy_attachment.lambda_dynamodb_migration_scan_put_update_and_kms_decrypt will be destroyed
  # (because aws_iam_role_policy_attachment.lambda_dynamodb_migration_scan_put_update_and_kms_decrypt is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_dynamodb_migration_scan_put_update_and_kms_decrypt" {
      - id         = "dev-dynamo-migration-lambda-role-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]01" -> null
      - policy_arn = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/lambda-dynamodb-scan-put-update-and-kms-decrypt-policy" -> null
      - role       = "dev-dynamo-migration-lambda-role" -> null
    }

  # aws_iam_role_policy_attachment.lambda_rds_migration_access will be destroyed
  # (because aws_iam_role_policy_attachment.lambda_rds_migration_access is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_rds_migration_access" {
      - id         = "dev-dynamo-migration-lambda-role-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]01" -> null
      - policy_arn = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/lambda-rds-access-policy" -> null
      - role       = "dev-dynamo-migration-lambda-role" -> null
    }

  # aws_iam_role_policy_attachment.lambda_vpc_access_execution will be destroyed
  # (because aws_iam_role_policy_attachment.lambda_vpc_access_execution is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_vpc_access_execution" {
      - id         = "dev-dynamo-migration-lambda-role-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]01" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole" -> null
      - role       = "dev-dynamo-migration-lambda-role" -> null
    }

  # aws_kms_key.alarm_notification will be updated in-place
  ~ resource "aws_kms_key" "alarm_notification" {
      + bypass_policy_lockout_safety_check = false
        id                                 = "f3c78d42-f9df-4b4f-bc8d-7a2c72e5e068"
      ~ tags                               = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-alarm_notification-kms-key"
        }
      ~ tags_all                           = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # aws_lambda_function.alarm_notifications_lambda will be updated in-place
  ~ resource "aws_lambda_function" "alarm_notifications_lambda" {
      ~ filename                       = "../notification-lambda/build/alarm.zip" -> "/home/runner/work/orphaned-record-continuity-infrastructure/orphaned-record-continuity-infrastructure/lambdas/alarm-lambda/build/alarm-lambda.zip"
        id                             = "dev-alarm-notifications-lambda"
      ~ last_modified                  = "2025-02-28T16:39:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "N1A2BEgwBveveypJvkphN+dL54jvH0fFUfljcbInTL4=" -> "pBlZzFXtW5rrXy9wOZqQwW5bJscS64VUa27laEfB/mM="
      ~ tags                           = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
        }
      ~ tags_all                       = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (1 unchanged element hidden)
        }
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.dynamo_migration will be destroyed
  # (because aws_lambda_function.dynamo_migration is not in configuration)
  - resource "aws_lambda_function" "dynamo_migration" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:function:dev-dynamo-migration-lambda" -> null
      - filename                       = "../dynamo-migration-lambda/build/dynamo-migration-lambda.zip" -> null
      - function_name                  = "dev-dynamo-migration-lambda" -> null
      - handler                        = "app.DynamoMigration.lambda_handler" -> null
      - id                             = "dev-dynamo-migration-lambda" -> null
      - invoke_arn                     = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:function:dev-dynamo-migration-lambda/invocations" -> null
      - last_modified                  = "2024-09-11T10:07:27.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:layer:psycopg2:1",
        ] -> null
      - memory_size                    = 1024 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:function:dev-dynamo-migration-lambda:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:function:dev-dynamo-migration-lambda:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "[REDACTED_IAM_ROLE_ARN]" -> null
      - runtime                        = "python3.10" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "lqTM0miBX01NtPX6Evt+QHsaoFd1h/3YRhaWAgi0wTw=" -> null
      - source_code_size               = 9098 -> null
      - tags                           = {
          - "CreatedBy"   = "prm-deductions-infra"
          - "Environment" = "dev"
          - "Terraform"   = "True"
        } -> null
      - tags_all                       = {
          - "CreatedBy"   = "prm-deductions-infra"
          - "Environment" = "dev"
          - "Terraform"   = "True"
        } -> null
      - timeout                        = 900 -> null
      - version                        = "$LATEST" -> null
        # (6 unchanged attributes hidden)

      - environment {
          - variables = {
              - "ENVIRONMENT_NAME" = "dev"
              - "NEW_TABLE_NAME"   = "dev-ehr-transfer-tracker"
              - "OLD_TABLE_NAME"   = "dev-ehr-transfer-service-transfer-tracker"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/dev-dynamo-migration-lambda" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - ipv6_allowed_for_dual_stack = false -> null
          - security_group_ids          = [
              - "sg-06df174eb101a7289",
              - "sg-0dbdc734eb64e8a92",
            ] -> null
          - subnet_ids                  = [
              - "subnet-01a31a4131d5935ee",
              - "subnet-02a341f756c411b2c",
            ] -> null
          - vpc_id                      = "vpc-025c6f38a44627454" -> null
        }
    }

  # aws_lambda_function.ehr_hard_deletion will be updated in-place
  ~ resource "aws_lambda_function" "ehr_hard_deletion" {
      ~ filename                       = "../ehr-hard-deletion-lambda/build/ehr-hard-deletion-lambda.zip" -> "/home/runner/work/orphaned-record-continuity-infrastructure/orphaned-record-continuity-infrastructure/lambdas/ehr-hard-deletion-lambda/build/EhrHardDeletion.zip"
        id                             = "dev-ehr-hard-deletion-lambda"
      ~ last_modified                  = "2024-06-10T15:53:31.000+0000" -> (known after apply)
      ~ tags                           = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Terraform"   = "True"
        }
      ~ tags_all                       = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.generate_cost_report_lambda will be updated in-place
  ~ resource "aws_lambda_function" "generate_cost_report_lambda" {
      ~ filename                       = "../generate-cost-report-lambda/build/generate-cost-report-lambda.zip" -> "../../../lambdas/generate-cost-report-lambda/build/generate-cost-report-lambda.zip"
        id                             = "dev-generate-cost-report-lambda"
      ~ last_modified                  = "2025-02-28T16:39:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "TBqV+Qp6jQ0Cw64ozRL9gi4AFxm9bPrSYo52+U//ThQ=" -> "AHroL/spn9Ss2VvSkeeDCA4eftvICdKpfp2S8r3umHM="
      ~ tags                           = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
        }
      ~ tags_all                       = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (1 unchanged element hidden)
        }
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.psycopg2 will be destroyed
  # (because aws_lambda_layer_version.psycopg2 is not in configuration)
  - resource "aws_lambda_layer_version" "psycopg2" {
      - arn                         = "arn:aws:lambda:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:layer:psycopg2:1" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.10",
        ] -> null
      - created_date                = "2024-05-03T15:25:52.254+0000" -> null
      - description                 = "Contains the psycopg2 library to connect to PostgreSQL databases" -> null
      - filename                    = "../lambda-layer-psycopg2/psycopg2.zip" -> null
      - id                          = "arn:aws:lambda:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:layer:psycopg2:1" -> null
      - layer_arn                   = "arn:aws:lambda:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:layer:psycopg2" -> null
      - layer_name                  = "psycopg2" -> null
      - skip_destroy                = false -> null
      - source_code_hash            = "b/h7RU17OnHSZu/60LT+TRiN2C/BG+B3ASgYhEc+CBk=" -> null
      - source_code_size            = 3077700 -> null
      - version                     = "1" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_route53_zone.environment_public will be updated in-place
  ~ resource "aws_route53_zone" "environment_public" {
        id                  = "Z06480051HWRJ17P0MISG"
        name                = "dev.non-prod.patient-deductions.nhs.uk"
      ~ tags                = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
      ~ tags_all            = {
          ~ "CreatedBy" = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket.access_logs will be updated in-place
  ~ resource "aws_s3_bucket" "access_logs" {
        id                          = "dev-orc-access-logs"
      ~ tags                        = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
        }
      ~ tags_all                    = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (1 unchanged element hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.alb_access_logs will be updated in-place
  ~ resource "aws_s3_bucket" "alb_access_logs" {
        id                          = "dev-repo-load-balancer-access-logs"
      ~ tags                        = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
        }
      ~ tags_all                    = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (1 unchanged element hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.cost_and_usage_access_logs will be updated in-place
  ~ resource "aws_s3_bucket" "cost_and_usage_access_logs" {
        id                          = "dev-cost-and-usage-access-logs"
      ~ tags                        = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
        }
      ~ tags_all                    = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (1 unchanged element hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.cost_and_usage_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "cost_and_usage_bucket" {
        id                          = "dev-cost-and-usage"
      ~ tags                        = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
        }
      ~ tags_all                    = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (1 unchanged element hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.alb_access_logs_policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "alb_access_logs_policy" {
        id     = "dev-repo-load-balancer-access-logs"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "logdelivery.elasticloadbalancing.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::dev-repo-load-balancer-access-logs/*"
                    },
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::dev-repo-load-balancer-access-logs/*",
                          - "arn:aws:s3:::dev-repo-load-balancer-access-logs",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket_policy.allow_access_from_billing_to_s3 will be updated in-place
  ~ resource "aws_s3_bucket_policy" "allow_access_from_billing_to_s3" {
        id     = "dev-cost-and-usage"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:GetBucketPolicy",
                          - "s3:GetBucketAcl",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "billingreports.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::dev-cost-and-usage"
                    },
                  - {
                      - Action    = "s3:PutObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "billingreports.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::dev-cost-and-usage/*"
                      - Sid       = "Stmt[REDACTED_AWS_ACCOUNT_ID]6"
                    },
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::dev-cost-and-usage/*",
                          - "arn:aws:s3:::dev-cost-and-usage",
                        ]
                      - Sid       = "S3EnforceHTTPSPolicy"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_sns_topic.alarm_notifications will be updated in-place
  ~ resource "aws_sns_topic" "alarm_notifications" {
        id                                       = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-alarm-notifications-sns-topic"
        name                                     = "dev-alarm-notifications-sns-topic"
      ~ tags                                     = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-alarm-notifications-sns-topic"
        }
      ~ tags_all                                 = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)
    }

  # aws_ssm_parameter.alb_access_logs_s3_bucket_id will be updated in-place
  ~ resource "aws_ssm_parameter" "alb_access_logs_s3_bucket_id" {
        id              = "/repo/dev/output/prm-deductions-infra/alb-access-logs-s3-bucket-id"
      + insecure_value  = (known after apply)
        name            = "/repo/dev/output/prm-deductions-infra/alb-access-logs-s3-bucket-id"
        tags            = {}
      ~ value           = (sensitive value)
      ~ version         = 2 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_ssm_parameter.environment_domain_name will be updated in-place
  ~ resource "aws_ssm_parameter" "environment_domain_name" {
        id              = "/repo/dev/output/prm-deductions-infra/environment-domain-name"
        name            = "/repo/dev/output/prm-deductions-infra/environment-domain-name"
      ~ tags            = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
        }
      ~ tags_all        = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.environment_private_zone_id will be updated in-place
  ~ resource "aws_ssm_parameter" "environment_private_zone_id" {
        id              = "/repo/dev/output/prm-deductions-infra/environment-private-zone-id"
        name            = "/repo/dev/output/prm-deductions-infra/environment-private-zone-id"
      ~ tags            = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
        }
      ~ tags_all        = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.environment_public_zone_id will be updated in-place
  ~ resource "aws_ssm_parameter" "environment_public_zone_id" {
        id              = "/repo/dev/output/prm-deductions-infra/environment-public-zone-id"
        name            = "/repo/dev/output/prm-deductions-infra/environment-public-zone-id"
      ~ tags            = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
        }
      ~ tags_all        = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.private_zone_id will be updated in-place
  ~ resource "aws_ssm_parameter" "private_zone_id" {
        id              = "/repo/dev/output/prm-deductions-infra/private-root-zone-id"
        name            = "/repo/dev/output/prm-deductions-infra/private-root-zone-id"
      ~ tags            = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
        }
      ~ tags_all        = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.repo_databases will be updated in-place
  ~ resource "aws_ssm_parameter" "repo_databases" {
        id              = "/repo/dev/output/prm-deductions-infra/repo-databases-parameter-group-name"
        name            = "/repo/dev/output/prm-deductions-infra/repo-databases-parameter-group-name"
      ~ tags            = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
        }
      ~ tags_all        = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.repo_databases_version_13 will be updated in-place
  ~ resource "aws_ssm_parameter" "repo_databases_version_13" {
        id              = "/repo/dev/output/prm-deductions-infra/repo-databases-parameter-group-name-version-13"
        name            = "/repo/dev/output/prm-deductions-infra/repo-databases-parameter-group-name-version-13"
      ~ tags            = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
        }
      ~ tags_all        = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # aws_vpc_peering_connection.core_private will be updated in-place
  ~ resource "aws_vpc_peering_connection" "core_private" {
        id            = "pcx-08bb55ac1bb3b74ee"
      ~ tags          = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-core-private-peering"
        }
      ~ tags_all      = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.deductions-core.data.aws_prefix_list.core_dynamodb will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_prefix_list" "core_dynamodb" {
      + cidr_blocks    = (known after apply)
      + id             = (known after apply)
      + name           = (known after apply)
      + prefix_list_id = "pl-b3a742da"
    }

  # module.deductions-core.data.aws_prefix_list.s3 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_prefix_list" "s3" {
      + cidr_blocks    = (known after apply)
      + id             = (known after apply)
      + name           = (known after apply)
      + prefix_list_id = "pl-7ca54015"
    }

  # module.deductions-core.aws_flow_log.nhs_audit will be updated in-place
  ~ resource "aws_flow_log" "nhs_audit" {
        id                         = "fl-05905f560d203b56e"
      ~ tags                       = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-core-vpc-audit-flow-logs"
        }
      ~ tags_all                   = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.deductions-core.aws_security_group.ecr-endpoint-sg will be updated in-place
  ~ resource "aws_security_group" "ecr-endpoint-sg" {
        id                     = "sg-042e52b62de3e505c"
        name                   = "dev-deductions-core-ecr-endpoint-sg"
      ~ tags                   = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-core-ecr-endpoint-sg"
        }
      ~ tags_all               = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.deductions-core.aws_security_group.logs-endpoint-sg will be updated in-place
  ~ resource "aws_security_group" "logs-endpoint-sg" {
        id                     = "sg-01270b833518c5719"
        name                   = "dev-deductions-core-logs-endpoint-sg"
      ~ tags                   = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-core-logs-endpoint-sg"
        }
      ~ tags_all               = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.deductions-core.aws_security_group.monitoring-sg will be updated in-place
  ~ resource "aws_security_group" "monitoring-sg" {
        id                     = "sg-0826a1719ec520269"
        name                   = "dev-deductions-core-monitoring-endpoint-sg"
      ~ tags                   = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-core-monitoring-endpoint-sg"
        }
      ~ tags_all               = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.deductions-core.aws_security_group.rds-sg will be updated in-place
  ~ resource "aws_security_group" "rds-sg" {
        id                     = "sg-0ea0ea31eaf6637a0"
        name                   = "dev-deductions-core-rds-endpoint-sg"
      ~ tags                   = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-core-rds-endpoint-sg"
        }
      ~ tags_all               = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.deductions-core.aws_security_group.ssm-endpoint-sg will be updated in-place
  ~ resource "aws_security_group" "ssm-endpoint-sg" {
        id                     = "sg-001c6b0ae1131afb1"
        name                   = "dev-deductions-core-ssm-endpoint-sg"
      ~ tags                   = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-core-ssm-endpoint-sg"
        }
      ~ tags_all               = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.deductions-core.aws_ssm_parameter.deductions_core_database_subnets will be updated in-place
  ~ resource "aws_ssm_parameter" "deductions_core_database_subnets" {
        id              = "/repo/dev/output/prm-deductions-infra/deductions-core-database-subnets"
        name            = "/repo/dev/output/prm-deductions-infra/deductions-core-database-subnets"
      ~ tags            = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
        }
      ~ tags_all        = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.deductions-core.aws_ssm_parameter.deductions_core_private_subnets will be updated in-place
  ~ resource "aws_ssm_parameter" "deductions_core_private_subnets" {
        id              = "/repo/dev/output/prm-deductions-infra/deductions-core-private-subnets"
        name            = "/repo/dev/output/prm-deductions-infra/deductions-core-private-subnets"
      ~ tags            = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
        }
      ~ tags_all        = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.deductions-core.aws_ssm_parameter.deductions_core_vpc_id will be updated in-place
  ~ resource "aws_ssm_parameter" "deductions_core_vpc_id" {
        id              = "/repo/dev/output/prm-deductions-infra/deductions-core-vpc-id"
        name            = "/repo/dev/output/prm-deductions-infra/deductions-core-vpc-id"
      ~ tags            = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
        }
      ~ tags_all        = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.deductions-core.aws_ssm_parameter.dynamodb_prefix_list_id will be updated in-place
  ~ resource "aws_ssm_parameter" "dynamodb_prefix_list_id" {
        id              = "/repo/dev/output/prm-deductions-infra/deductions-core/dynamodb_prefix_list_id"
      + insecure_value  = (known after apply)
        name            = "/repo/dev/output/prm-deductions-infra/deductions-core/dynamodb_prefix_list_id"
        tags            = {}
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.deductions-core.aws_ssm_parameter.s3_prefix_list_id will be updated in-place
  ~ resource "aws_ssm_parameter" "s3_prefix_list_id" {
        id              = "/repo/dev/output/prm-deductions-infra/deductions-core/s3-prefix-list-id"
      + insecure_value  = (known after apply)
        name            = "/repo/dev/output/prm-deductions-infra/deductions-core/s3-prefix-list-id"
        tags            = {}
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.deductions-core.aws_vpc_endpoint.cloudwatch-logs will be updated in-place
  ~ resource "aws_vpc_endpoint" "cloudwatch-logs" {
        id                    = "vpce-017c0a9a405feba6a"
      ~ tags                  = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-core-logs-endpoint"
        }
      ~ tags_all              = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.deductions-core.aws_vpc_endpoint.dynamodb_gateway_endpoint will be updated in-place
  ~ resource "aws_vpc_endpoint" "dynamodb_gateway_endpoint" {
        id                    = "vpce-00c1f8bd4d96cd12f"
      ~ tags                  = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-core-dynamo-endpoint"
        }
      ~ tags_all              = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.deductions-core.aws_vpc_endpoint.ecr-api will be updated in-place
  ~ resource "aws_vpc_endpoint" "ecr-api" {
        id                    = "vpce-0da2ccc431ac80b1b"
      ~ tags                  = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-core-ecr-api-endpoint"
        }
      ~ tags_all              = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.deductions-core.aws_vpc_endpoint.ecr-dkr will be updated in-place
  ~ resource "aws_vpc_endpoint" "ecr-dkr" {
        id                    = "vpce-072b87881198cfc0a"
      ~ tags                  = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-core-ecr-dkr-endpoint"
        }
      ~ tags_all              = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.deductions-core.aws_vpc_endpoint.monitoring will be updated in-place
  ~ resource "aws_vpc_endpoint" "monitoring" {
        id                    = "vpce-02c6ae59f13733496"
      ~ tags                  = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-core-monitoring-endpoint"
        }
      ~ tags_all              = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.deductions-core.aws_vpc_endpoint.rds will be updated in-place
  ~ resource "aws_vpc_endpoint" "rds" {
        id                    = "vpce-09803348d225a8060"
      ~ tags                  = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-core-rds-endpoint"
        }
      ~ tags_all              = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.deductions-core.aws_vpc_endpoint.s3 will be updated in-place
  ~ resource "aws_vpc_endpoint" "s3" {
        id                    = "vpce-0ba51c1e6f97a74db"
      ~ tags                  = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-core-s3-endpoint"
        }
      ~ tags_all              = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.deductions-core.aws_vpc_endpoint.ssm will be updated in-place
  ~ resource "aws_vpc_endpoint" "ssm" {
        id                    = "vpce-0a16fbd8c42adf78e"
      ~ tags                  = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-core-ssm-endpoint"
        }
      ~ tags_all              = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.deductions-core.aws_vpc_peering_connection.core_to_gocd will be updated in-place
  ~ resource "aws_vpc_peering_connection" "core_to_gocd" {
        id            = "pcx-00cba6404abba4365"
      ~ tags          = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-core-gocd-peering"
            "Side"        = "Requester"
        }
      ~ tags_all      = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (3 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.deductions-core.aws_vpc_peering_connection_accepter.core_to_gocd[0] will be updated in-place
  ~ resource "aws_vpc_peering_connection_accepter" "core_to_gocd" {
        id                        = "pcx-00cba6404abba4365"
      ~ tags                      = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-core-gocd-peering-connection-accepter"
            "Side"        = "Accepter"
        }
      ~ tags_all                  = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (3 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.deductions-private.data.aws_prefix_list.private_dynamodb will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_prefix_list" "private_dynamodb" {
      + cidr_blocks    = (known after apply)
      + id             = (known after apply)
      + name           = (known after apply)
      + prefix_list_id = "pl-b3a742da"
    }

  # module.deductions-private.data.aws_prefix_list.s3 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_prefix_list" "s3" {
      + cidr_blocks    = (known after apply)
      + id             = (known after apply)
      + name           = (known after apply)
      + prefix_list_id = "pl-7ca54015"
    }

  # module.deductions-private.aws_cloudwatch_log_group.vpn will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "vpn" {
        id                = "dev-vpn-client-logs"
        name              = "dev-vpn-client-logs"
      ~ tags              = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
        }
      ~ tags_all          = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.deductions-private.aws_ec2_client_vpn_endpoint.vpn will be updated in-place
  ~ resource "aws_ec2_client_vpn_endpoint" "vpn" {
        id                      = "cvpn-endpoint-0646f88c407416bd7"
      ~ tags                    = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-vpn"
        }
      ~ tags_all                = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.deductions-private.aws_flow_log.nhs_audit will be updated in-place
  ~ resource "aws_flow_log" "nhs_audit" {
        id                         = "fl-08eb7a8afce2ca52a"
      ~ tags                       = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-private-vpc-audit-flow-logs"
        }
      ~ tags_all                   = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.deductions-private.aws_mq_broker.deductor_mq_broker will be updated in-place
  ~ resource "aws_mq_broker" "deductor_mq_broker" {
        id                         = "b-09f25472-2c58-4386-ad2c-675ce15efbd6"
      ~ tags                       = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
        }
      ~ tags_all                   = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (1 unchanged element hidden)
        }
        # (14 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.deductions-private.aws_security_group.ecr-endpoint-sg will be updated in-place
  ~ resource "aws_security_group" "ecr-endpoint-sg" {
        id                     = "sg-04aa94174beef1f76"
        name                   = "dev-deductions-private-ecr-endpoint-sg"
      ~ tags                   = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-private-ecr-endpoint-sg"
        }
      ~ tags_all               = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.deductions-private.aws_security_group.gocd_to_mq will be updated in-place
  ~ resource "aws_security_group" "gocd_to_mq" {
        id                     = "sg-0f15605e326c7f51b"
        name                   = "dev-gocd-to-mq"
      ~ tags                   = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-gocd-to-deductions-private-sg"
        }
      ~ tags_all               = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.deductions-private.aws_security_group.logs-endpoint-sg will be updated in-place
  ~ resource "aws_security_group" "logs-endpoint-sg" {
        id                     = "sg-04103d37cc998df4d"
        name                   = "dev-deductions-private-logs-endpoint-sg"
      ~ tags                   = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-private-logs-endpoint-sg"
        }
      ~ tags_all               = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.deductions-private.aws_security_group.monitoring-sg will be updated in-place
  ~ resource "aws_security_group" "monitoring-sg" {
        id                     = "sg-0d64e11183ca4f85f"
        name                   = "dev-deductions-private-monitoring-endpoint-sg"
      ~ tags                   = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-private-monitoring-endpoint-sg"
        }
      ~ tags_all               = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.deductions-private.aws_security_group.service_to_mq will be updated in-place
  ~ resource "aws_security_group" "service_to_mq" {
        id                     = "sg-0423e1d17c6dbec0f"
        name                   = "dev-service-to-mq"
      ~ tags                   = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-service-to-deductions-private-sg"
        }
      ~ tags_all               = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.deductions-private.aws_security_group.sns-sg will be updated in-place
  ~ resource "aws_security_group" "sns-sg" {
        id                     = "sg-0c2fbed797e1814bf"
        name                   = "dev-deductions-private-sns-endpoint-sg"
      ~ tags                   = {
          ~ "CreatedBy"   = "prm-deductions-infra" -> "orphaned-record-continuity-infrastructure"
            "Environment" = "dev"
            "Name"        = "dev-deductions-p
(truncated - see workflow logs for full output)
```

</details>